Reports/б_ОтчетПоБюджету5БК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>б_ОтчетПоБюджету5БК</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/бит_ОтветственныеЛицаБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ОтветственныеЛицаБюджет</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/б_ОтчетПоБюджету5БК/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	
	ПараметрНачалоПериода = ПараметрыДанных.Найти("ДатаНачала").Значение;	
   
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТекущГод = Год(ПараметрНачалоПериода);
	  
	Для Каждого Поле Из Настройки.Выбор.Элементы Цикл
			
		// ++ USRomanov@1cbit.ru 10.12.2020
		ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ФактПредыдущийГод");
		Если ВычисляемоеПоле = Неопределено Тогда 
			ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Добавить();
			ВычисляемоеПоле.ПутьКДанным	= "ФактПредыдущийГод";
			ВычисляемоеПоле.Выражение	= ВычисляемоеПоле.ПутьКДанным + "Ком";
		КонецЕсли;
		ВычисляемоеПоле.Заголовок = "Факт "+Формат(ТекущГод - 1,"ЧГ=0")+" года";
		
		ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ФактПредшествующий");
		Если ВычисляемоеПоле = Неопределено Тогда 
			ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Добавить();
			ВычисляемоеПоле.ПутьКДанным	= "ФактПредшествующий";
			ВычисляемоеПоле.Выражение	= ВычисляемоеПоле.ПутьКДанным + "Ком";
		КонецЕсли;
		ВычисляемоеПоле.Заголовок = "Факт "+Формат(ТекущГод - 2,"ЧГ=0")+" года";
		
		ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ФактТриГодаНазад");
		Если ВычисляемоеПоле = Неопределено Тогда 
			ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Добавить();
			ВычисляемоеПоле.ПутьКДанным	= "ФактТриГодаНазад";
			ВычисляемоеПоле.Выражение	= ВычисляемоеПоле.ПутьКДанным + "Ком";
		КонецЕсли;
		ВычисляемоеПоле.Заголовок = "Факт "+Формат(ТекущГод - 3,"ЧГ=0")+" года";
		// -- USRomanov@1cbit.ru 10.12.2020
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ФактПредыдущийГод");
		Если Поле <> Неопределено Тогда
			
			Если Год(НачалоДня(Дата(ТекущГод-1,1,1))) = 2016
					ИЛИ Год(НачалоДня(Дата(ТекущГод-1,1,1))) = 2017 
					ИЛИ Год(НачалоДня(Дата(ТекущГод-1,1,1))) = 2018 Тогда
				Поле.Заголовок = "Факт "+Формат(ТекущГод-1,"ЧГ=0")+" года";
			Иначе
				Поле.Заголовок = "Факт "+Формат(ТекущГод-1,"ЧГ=0")+" года";
			КонецЕсли;

			Если ПараметрыДанных.Найти("Оценка").Значение = Истина Тогда
				Поле.Заголовок = "План " + Формат(ТекущГод-1,"ЧГ=0")+" года (корректировка, оценка)";
			КонецЕсли;

		КонецЕсли;
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ФактПредшествующий");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "Факт " + Формат(ТекущГод-2,"ЧГ=0")+" года";
		КонецЕсли;
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ФактТриГодаНазад");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "Факт " + Формат(ТекущГод-3,"ЧГ=0")+" года";
		КонецЕсли;
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ПланПредыдущийГод");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(ТекущГод-1,"ЧГ=0")+" года";
			
			Если Год(НачалоДня(Дата(ТекущГод-1,1,1))) = 2019 Тогда

				Поле.Заголовок = "План " + Формат(ТекущГод-1,"ЧГ=0")+" года (корректировка, оценка)";
				
			КонецЕсли;
			
		КонецЕсли;

		Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение1");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(ТекущГод,"ЧГ=0")+ " года к факту "+ Формат(ТекущГод-1,"ЧГ=0") +" года, %";   
			
			Если ПараметрыДанных.Найти("Оценка").Значение = Истина Тогда
				Поле.Заголовок = "План " + Формат(ТекущГод,"ЧГ=0")+ " года к плану "+ Формат(ТекущГод-1,"ЧГ=0") +" года (коррект), %";
			КонецЕсли;

		КонецЕсли;
		
			
			
		Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение2");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(ТекущГод,"ЧГ=0")+ " года к факту "+ Формат(ТекущГод-2,"ЧГ=0") +" года, %";
		КонецЕсли;
		
		Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение3");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(ТекущГод,"ЧГ=0")+ " года к факту "+ Формат(ТекущГод-3,"ЧГ=0") +" года, %";
		КонецЕсли;

		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаИтого");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(ТекущГод,"ЧГ=0")+" года";
		КонецЕсли;

		Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ФактКФактуПредыдущий");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = " % к "+ Формат(ТекущГод-2,"ЧГ=0") +" году";
		КонецЕсли;
		
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ФактПредыдущийГодКом");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "Факт ПКК " + Формат(ТекущГод-1,"ЧГ=0")+" г";
		КонецЕсли;
		
		Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("ФактПредыдущийГодДЗО");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "Факт дочек " + Формат(ТекущГод-1,"ЧГ=0")+" г";
		КонецЕсли;
		
	
	КонецЦикла;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
             
    //Помещаем в переменную данные о расшифровке данных
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
     
    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
     
    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    //Передаем внешний набор данных
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
     
    //Очищаем поле табличного документа
	ДокументРезультат.Очистить();
	
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.Руководитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(Справочники.бит_ОтветственныеЛицаБюджет.РуководительОрганизации.Сотрудник.Физлицо);
	ОбластьПодвал.Параметры.РуководительДолжность = Справочники.бит_ОтветственныеЛицаБюджет.РуководительОрганизации.Должность;
	ОбластьПодвал.Параметры.РуководительФД = ОбщегоНазначения.ФамилияИнициалыФизЛица(Справочники.бит_ОтветственныеЛицаБюджет.РуководительФД.Сотрудник.Физлицо);
	ОбластьПодвал.Параметры.РуководительФДДолжность = Справочники.бит_ОтветственныеЛицаБюджет.РуководительФД.Должность;
	ОбластьПодвал.Параметры.Исполнитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(Справочники.бит_ОтветственныеЛицаБюджет.Исполнитель.Сотрудник.Физлицо);
	ОбластьПодвал.Параметры.Телефон = Справочники.бит_ОтветственныеЛицаБюджет.Исполнитель.Комментарий;

	
	ОбластьШапка.Параметры.Год = Формат(ТекущГод, "ЧГ=0");
	ДокументРезультат.Вывести(ОбластьШапка);

    //Выводим результат в табличный документ
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
     
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры
